/*
 * Copyright (c) 2012 - 2015 The Linux Foundation. All rights reserved.
 */

#ifndef _IPQ_GMAC_H
#define _IPQ_GMAC_H
#include <common.h>
#include <net.h>
#include <configs/ipq806x_cdp.h>

#define CONFIG_MACRESET_TIMEOUT			(3 * CONFIG_SYS_HZ)
#define CONFIG_MDIO_TIMEOUT			(3 * CONFIG_SYS_HZ)
#define CONFIG_PHYRESET_TIMEOUT			(3 * CONFIG_SYS_HZ)
#define CONFIG_AUTONEG_TIMEOUT			(5 * CONFIG_SYS_HZ)
/* MAC configuration register definitions */
#define FRAMEBURSTENABLE			(1 << 21)
#define MII_PORTSELECT				(1 << 15)
#define FES_100					(1 << 14)
#define DISABLERXOWN				(1 << 13)
#define FULLDPLXMODE				(1 << 11)
#define RXENABLE				(1 << 2)
#define TXENABLE				(1 << 3)
#define DW_DMA_BASE_OFFSET			(0x1000)

/* Poll demand definitions */
#define POLL_DATA				(0x0)


/* Descriptior related definitions */
#define MAC_MAX_FRAME_SZ			(1600)

/*
 * txrx_status definitions
 */

/* tx status bits definitions */
#define DESC_TXSTS_OWNBYDMA			(1 << 31)
#define DESC_TXSTS_TXINT			(1 << 30)
#define DESC_TXSTS_TXLAST			(1 << 29)
#define DESC_TXSTS_TXFIRST			(1 << 28)
#define DESC_TXSTS_TXCRCDIS			(1 << 27)

#define DESC_TXSTS_TXPADDIS			(1 << 26)
#define DESC_TXSTS_TXCHECKINSCTRL		(3 << 22)
#define DESC_TXSTS_TXRINGEND			(1 << 21)
#define DESC_TXSTS_TXCHAIN			(1 << 20)
#define DESC_TXSTS_MSK				(0x1FFFF << 0)

/* rx status bits definitions */
#define DESC_RXSTS_OWNBYDMA			(1 << 31)
#define DESC_RXSTS_DAFILTERFAIL			(1 << 30)
#define DESC_RXSTS_FRMLENMSK			(0x3FFF << 16)

#define CAL_PRBS_RST_N_RESET_CLR		(1 << 26)
#define LCKDT_RST_N_RESET_CLR			(1 << 27)
#define PCS_CH_SPEED_FORCE_OUTSIDE		8
#define PCS_CHn_SPEED_FORCE_OUTSIDE(n)		(PCS_CH_SPEED_FORCE_OUTSIDE << \
						(n * 4))
/* PCS channel bit definitions */
#define PCS_DEBUG_SELECT			0xF0000000
#define PCS_CH0_FORCE_SPEED			2
#define PCS_CHn_FORCE_SPEED(n)			(PCS_CH0_FORCE_SPEED << (n * 4))
#define PCS_CH0_SPEED_MASK			0xC
#define PCS_CHn_SPEED_MASK(n)			(PCS_CH0_SPEED_MASK << (n * 4))
#define PCS_CH_SPEED_10				0x0
#define PCS_CH_SPEED_100			0x4
#define PCS_CH_SPEED_1000			0x8
#define PCS_CHn_SPEED(ch, speed)		(speed << (ch * 4))


#define PCS_CHn_ANEG_EN(ch)			(1 << ((ch * 8) + 7))
#define PCS_CHn_ANEG_DISABLE(ch)		(~PCS_CHn_ANEG_EN(ch))

#define PCS_SGMII_MAC				2

#define PCS_CH0_SD_SERDES			(1 << 16)
#define PCS_CH1_SD_SERDES			(1 << 17)
#define PCS_CH2_SD_SERDES			(1 << 18)
#define PCS_CH3_SD_SERDES			(1 << 19)

#define PHY_SPEED_DUPLEX_RESOLVED_MASK		1
#define PHY_SPEED_DUPLEX_RESOLVED_SHIFT		11
#define PHY_SPEED_MASK				3
#define PHY_SPEED_SHIFT				14
#define PHY_DUPLEX_SHIFT			13
#define PHY_DUPLEX_MASK				1
#define SPEED_1000M				2
#define SPEED_100M				1
#define SPEED_10M				0

/* PHY addr for 8033 Port */
#define GMAC_8033_PORT0				0x6
#define GMAC_8033_PORT1				0x7

#define NSS_ETH_CLK_DIV(clk_div, mac_unit)	(clk_div << (mac_unit * 8))
#define NSS_ETH_CLK_DIV_SHIFT			16
#define NSS_ETH_CLK_DIV_MASK			0x7F
#define CLK_DIV_SGMII_100M			(CLK_DIV_QSGMII_100M / 2)
#define CLK_DIV_SGMII_1000M			(CLK_DIV_QSGMII_1000M / 2)
#define CLK_DIV_SGMII_10M			(CLK_DIV_QSGMII_10M / 2)
#define CLK_DIV_QSGMII_100M			10
#define CLK_DIV_QSGMII_1000M			2
#define CLK_DIV_QSGMII_10M			100
#define CLK_DIV_SHIFT				8
#define MAC_CFG_DUPLEX_SHIFT			11
#define GMAC_UNIT0				0
#define GMAC_UNIT1				1
#define GMAC_UNIT2				2
#define GMAC_UNIT3				3

/* Bit definitions for PCS_QSGMII_CTL register */
#define PCS_QSGMII_SW_VER_1_7			0x2
#define PCS_QSGMII_CUTTHROUGH_RX		0x8
#define PCS_QSGMII_CUTTHROUGH_TX		0x4
#define PCS_QSGMII_SW_VER_1_7			0x2
#define PCS_QSGMII_ATHR_CSCO_AUTONEG		0x1
#define PCS_QSGMII_SHORT_LATENCY		0x20
#define PCS_QSGMII_SHORT_THRESH			0x10
#define PCS_QSGMII_DEPTH_THRESH(n)		(n << 8)
#define PCS_CH0_SERDES_SN_DETECT		0x800
#define PCS_CHn_SERDES_SN_DETECT(n)		(PCS_CH0_SERDES_SN_DETECT << n)
#define PCS_CH0_SERDES_SN_DETECT_2		0x10000
#define PCS_CHn_SERDES_SN_DETECT_2(n)		(PCS_CH0_SERDES_SN_DETECT_2 << n)

#define PCS_QSGMII_MAC_LINK(stat, macn)		(((stat) >> \
						(macn * 8)) & 1)

#define PCS_QSGMII_MAC_SPEED(stat,macn)		(((stat) >> \
						((macn * 8) + 2)) & 3)

#define PCS_QSGMII_MAC_DUPLEX(stat,macn)	(((stat) >> \
						((macn * 8) + 1)) & 1)

#define NSS_ETH_GMAC_PHY_INTF_SEL		(0 << 16)
#define NSS_ETH_GMAC_PHY_IFG_LIMIT		(12 << 8)
#define NSS_ETH_GMAC_PHY_IFG			12
#define MACSEC_BYPASS_EXT_EN			0x7

#define phy_reg_read(base, addr, reg)	\
	ipq_mdio_read(addr, reg, NULL)

#define phy_reg_write(base, addr, reg, data)	\
	ipq_mdio_write(addr, reg, data)


typedef struct
{
	volatile u32 status;		/* Status */
	volatile u32 length;		/* Buffer 1 and Buffer 2 length */
	volatile u32 buffer1;		/* Network Buffer 1 pointer (Dma-able) */
	volatile u32 data1;		/* This holds virtual address of buffer1, not used by DMA */
	/* Following is used only by driver */
	volatile u32 extstatus;		/* Extended status of a Rx Descriptor */
	volatile u32 reserved1;		/* Reserved word */
	volatile u32 timestamplow;	/* Lower 32 bits of the 64 bit timestamp value */
	volatile u32 timestamphigh;	/* Higher 32 bits of the 64 bit timestamp value */
} ipq_gmac_desc_t ;

struct ipq_forced_mode {
	u32 speed;
	u32 phy_addr;
	u8 miiwrite_done;
	u8 gmac_port;
	u8 is_forced;
};

struct bitbang_nodes {
	int mdio;
	int mdc;
} __attribute__ ((aligned(8)));

struct ipq_eth_dev {
	u8			*phy_address;
	uint			no_of_phys;
	uint			interface;
	uint			speed;
	uint			duplex;
	uint			phy_configured;
	uint			mac_unit;
	uint			mac_ps;
	int			link_printed;
	u32			padding;
	ipq_gmac_desc_t		*desc_tx[NO_OF_TX_DESC];
	ipq_gmac_desc_t		*desc_rx[NO_OF_RX_DESC];
	uint			next_tx;
	uint			next_rx;
	int			txdesc_count;
	int			rxdesc_count;
	struct eth_mac_regs	*mac_regs_p;
	struct eth_dma_regs	*dma_regs_p;
	struct eth_device *dev;
	const char phy_name[MDIO_NAME_LEN];
	struct ipq_forced_mode *forced_params;
	ipq_gmac_board_cfg_t	*gmac_board_cfg;
} __attribute__ ((aligned(8)));

struct eth_mac_regs {
	u32 conf;		/* 0x00 */
	u32 framefilt;		/* 0x04 */
	u32 hashtablehigh;	/* 0x08 */
	u32 hashtablelow;	/* 0x0c */
	u32 miiaddr;		/* 0x10 */
	u32 miidata;		/* 0x14 */
	u32 flowcontrol;	/* 0x18 */
	u32 vlantag;		/* 0x1c */
	u32 version;		/* 0x20 */
	u8 reserved_1[20];	/* 0x24 -- 0x37 */
	u32 intreg;		/* 0x38 */
	u32 intmask;		/* 0x3c */
	u32 macaddr0hi;		/* 0x40 */
	u32 macaddr0lo;		/* 0x44 */
};

struct eth_dma_regs {
	u32 busmode;		/* 0x00 */
	u32 txpolldemand;	/* 0x04 */
	u32 rxpolldemand;	/* 0x08 */
	u32 rxdesclistaddr;	/* 0x0c */
	u32 txdesclistaddr;	/* 0x10 */
	u32 status;		/* 0x14 */
	u32 opmode;		/* 0x18 */
	u32 intenable;		/* 0x1c */
	u8 reserved[40];	/* 0x20 -- 0x47 */
	u32 currhosttxdesc;	/* 0x48 */
	u32 currhostrxdesc;	/* 0x4c */
	u32 currhosttxbuffaddr;	/* 0x50 */
	u32 currhostrxbuffaddr;	/* 0x54 */
};

void athrs17_reg_init(ipq_gmac_board_cfg_t *);
void gmac_reset(void);
void gmacsec_reset(void);

enum DmaDescriptorStatus {	/* status word of DMA descriptor */
	DescOwnByDma		= 0x80000000,	/* (OWN)Descriptor is owned by DMA engine		31	RW	*/

	DescDAFilterFail	= 0x40000000,	/* (AFM)Rx - DA Filter Fail for the rx frame		30		*/

	DescFrameLengthMask	= 0x3FFF0000,	/* (FL)Receive descriptor frame length			29:16		*/
	DescFrameLengthShift	= 16,

	DescError		= 0x00008000,	/* (ES)Error summary bit - OR of the follo. bits:	15		*/
						/* DE || OE || IPC || LC || RWT || RE || CE */
	DescRxTruncated		= 0x00004000,	/* (DE)Rx - no more descriptors for receive frame	14		*/
	DescSAFilterFail	= 0x00002000,	/* (SAF)Rx - SA Filter Fail for the received frame	13		*/
	DescRxLengthError	= 0x00001000,	/* (LE)Rx - frm size not matching with len field	12		*/
	DescRxDamaged		= 0x00000800,	/* (OE)Rx - frm was damaged due to buffer overflow	11		*/
